tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "cask"
brew "mas"

# --- Package Managers ---
brew "node"
brew "yarn"

# --- Shell ---
brew "zsh"

# --- Java ---
brew "java"

# --- Editors ------------
brew "neovim"
cask "iterm2"
cask "visual-studio-code"

# --- Fonts ---
brew "fontforge"
tap "homebrew/cask-fonts"

# --- Command Line Tools ---
brew "wget"
brew "tree"
brew "exa"
brew "bat"
brew "fd"
brew "procs"
brew "ripgrep"
brew "jq"
brew "openssl"
brew "trash"

# --- git ---
brew "git"
brew "gist"
brew "git-lfs"
brew "gh"

# --- Google Cloud Platform ---
cask "google-cloud-sdk"

# --- Kubernetes ---
brew "kubectl"
brew "kustomize"
brew "stern"
brew "k9s"

# --- DB ---
cask "db-browser-for-sqlite"

# --- Communication ---
cask "zoom"
mas "LINE", id: 539883307

# --- File Sync ---
cask "dropbox"
cask "google-backup-and-sync"

# --- Browsers ---
cask "google-chrome"
cask "pushplaylabs-sidekick"
cask "brave-browser"
cask "biscuit"

# --- Videos ---
brew "ffmpeg"
brew "youtube-dl"
cask "vlc"
cask "obs"
mas "iMovie", id: 408981434

# --- Images ---
cask "imageoptim"
cask "skitch"

# --- Language and Input ---
cask "google-japanese-ime"

# --- Office Softwares ---
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825

# --- Productivity ---
cask "bettertouchtool"
cask "alfred"

# --- Other Mac Apps ---
# cask "bitwarden" # 指紋認証は App Store 版のみ対応
cask "appcleaner"
cask "the-unarchiver"
cask "kindle"
mas "Bandwidth+", id: 490461369

# --- Flutter ---
brew "dart-lang/dart"
brew "dart"
